bit-finance/Reports/бит_ПротоколВыполненияРегламентнойОперации.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>бит_ПротоколВыполненияРегламентнойОперации</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

bit-finance/InformationRegisters/бит_ПротоколВыполненияРегламентныхОпераций.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ПротоколВыполненияРегламентныхОпераций</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>RecorderPosition</InformationRegisterPeriodicity>
			<WriteMode>RecorderSubordinate</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Протокол</Name>
					<Comment>Протокол</Comment>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

bit-finance/Reports/бит_ПротоколВыполненияРегламентнойОперации/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныйПрограммныйИнтерфейс

// Процедура выполняет формирование отчета.
// 
// ДокументРезультат - ТабличныйДокумент - результат формирования отчета.
//
Процедура СформироватьОтчет(ДокументРезультат) Экспорт

	ВозможностьПостроения = ОпределитьВозможностьПолученияОтчета();
	Если Не ВозможностьПостроения Тогда
		Возврат;
	КонецЕсли;

	ДокументРезультат.Очистить();
	
	ТабДок = ПолучитьПротоколПроведения(Документ);
	ДокументРезультат.Вывести(ТабДок);

	ДокументРезультат.ОтображатьГруппировки = Истина;
	ДокументРезультат.ОтображатьЗаголовки 	= Ложь;
	ДокументРезультат.ОтображатьСетку 		= Ложь;
	ДокументРезультат.ТолькоПросмотр 		= Истина;
	ДокументРезультат.Автомасштаб 			= Истина;
	
КонецПроцедуры

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

// Функция возвращает протокол проведения документа.
// 
// Параметры:
//  Док - ДокументСсылка.
// 
// Возвращаемое значение:
//  Результат - ТабличныйДокумент.
// 
Функция ПолучитьПротоколПроведения(Док)

	ТекстЗапроса = 
	"ВЫБРАТЬ
	|	бит_ПротоколВыполненияРегламентныхОпераций.Протокол
	|ИЗ
	|	РегистрСведений.бит_ПротоколВыполненияРегламентныхОпераций КАК бит_ПротоколВыполненияРегламентныхОпераций
	|ГДЕ
	|	бит_ПротоколВыполненияРегламентныхОпераций.Регистратор = &Документ";
	
	Запрос = Новый Запрос(ТекстЗапроса);	
	Запрос.УстановитьПараметр("Документ", Док);
	
	Выборка = Запрос.Выполнить().Выбрать();	
	Если Выборка.Следующий() Тогда
		Возврат Выборка.Протокол.Получить();
	Иначе
		Возврат Новый ТабличныйДокумент;
	КонецЕсли;
	
КонецФункции // ПолучитьПротоколПроведения()

// Функция определяет можно ли получить отчет по документу или нет.
// 
Функция ОпределитьВозможностьПолученияОтчета()
	
	Если Не ЗначениеЗаполнено(Документ) Тогда		
		#Если Клиент Тогда
			ПоказатьПредупреждение(, НСтр("ru = 'Запишите и проведите документ, по которому формируется отчет'; 
										  |en = 'Record and post the document on which the report is generated'"));
		#КонецЕсли		
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;
	
КонецФункции

#КонецОбласти 

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
